package ru.nn.nntu.vst.otivs.model;


public interface Questions {

    String S1 = "Компьютер исправно включается?";
    String S2 = "Блок питания исправен?";
    String S3 = "Материнская плата исправна?";
    String S4 = "Разъемы подключены правильно?";
    String S5 = "Комплектующие подходящие?";
    String S6 = "Проблема до загрузки ОС?";
    String S7 = "BIOS исправен?";
    String S8 = "ОС установлена?";
    String S9 = "Проблема в подключении периферийных устройств?";
    String S10 = "Проблема в выводе изображения?";
    String S11 = "Драйверы установлены корректно?";

    String F1 = "Замените блок питания";
    String F2 = "Отнесите компьютер в сервисный центр";
    String F3 = "Подберите подходящие комплектующие";
    String F4 = "Подключите разъемы согласно инструкции";
    String F5 = "Проверьте правильность установки ОС";
    String F6 = "Установите ОС";
    String F7 = "Измените настройки BIOS";
    String F8 = "Замените периферийное устройство";
    String F9 = "Переустановите драйверы";
    String F10 = "Проверьте правильность подключения видеокарты";
    String F11 = "Если проблема и есть, она находится в настройках какого-то конкретного приложения на компьютере. " +
            "Аппаратная и системная программная части исправны";

}
